{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "mainland China politics",
    "1": "Hong Kong - Macau politics",
    "2": "International news",
    "3": "financial news",
    "4": "culture",
    "5": "entertainment",
    "6": "sports"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "mainland China politics": 0,
    "Hong Kong - Macau politics": 1,
    "International news": 2,
    "financial news": 3,
    "culture": 4,
    "entertainment": 5,
    "sports": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "vocab_size": 21128
}
